Revit 2025 API
OrdinateDimensionLineStyle Enumeration
 The ordinate dimension line style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum OrdinateDimensionLineStyle
Public Enumeration OrdinateDimensionLineStyle
public enum class OrdinateDimensionLineStyle
type OrdinateDimensionLineStyle
Members
Member name | Value | Description
None | 0 |  Shows no dimension line. When you select the dimension line in the drawing area, a hidden line displays.
Continuous | 1 |  Displays the dimension line as continuous.
Segmented | 2 |  Segments the dimension line. Specify the length of the segments with the DimensionLineLength property.
See Also
Reference
Autodesk.Revit.DB Namespace